app/controllers/brands_controller.rb

  def show
    @brand = Brand.find(params[:id])
---
SELECT "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @brand = Brand.new(params[:brand])

    respond_to do |format|
      if @brand.save
---
INSERT INTO "brands" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 08 Apr 2013 22:14:34 UTC +00:00], ["name", "Fiat"], ["updated_at", Mon, 08 Apr 2013 22:14:34 UTC +00:00]]