app/controllers/customers_controller.rb

INSERT INTO "customers" ("created_at", "email", "name", "phone", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 08 Apr 2013 22:12:52 UTC +00:00], ["email", "Anddyyy@hotmail.com"], ["name", "Montootoo Palanca"], ["phone", "2233621"], ["updated_at", Mon, 08 Apr 2013 22:12:52 UTC +00:00]]
---
  def create
    @customer = Customer.new(params[:customer])

    respond_to do |format|
      if @customer.save