app/controllers/vehicle_types_controller.rb

  def index
    @vehicle_types = VehicleType.all
---
SELECT "vehicle_types".* FROM "vehicle_types"

  def show
    @vehicle_type = VehicleType.find(params[:id])
---
SELECT "vehicle_types".* FROM "vehicle_types" WHERE "vehicle_types"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @vehicle_type = VehicleType.new(params[:vehicle_type])

    respond_to do |format|
      if @vehicle_type.save
---
INSERT INTO "vehicle_types" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 08 Apr 2013 22:13:39 UTC +00:00], ["name", "Auto"], ["updated_at", Mon, 08 Apr 2013 22:13:39 UTC +00:00]]