app/controllers/vehicles_controller.rb

SELECT "vehicles".* FROM "vehicles"
---
  def index
    @vehicles = Vehicle.all

SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @vehicle = Vehicle.find(params[:id])

INSERT INTO "vehicles" ("brand_id", "created_at", "customer_id", "name", "updated_at", "vehicle_type_id") VALUES (?, ?, ?, ?, ?, ?)  [["brand_id", 4], ["created_at", Wed, 10 Apr 2013 20:01:40 UTC +00:00], ["customer_id", 1], ["name", "Gol 1.6"], ["updated_at", Wed, 10 Apr 2013 20:01:40 UTC +00:00], ["vehicle_type_id", 1]]
---
  def create
    @vehicle = Vehicle.new(params[:vehicle])

    respond_to do |format|
      if @vehicle.save